gicking/STM8_headers/SVD/STM8S208S6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RST</name>
      <baseAddress>0x50B3</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0001</size>
        <usage>registers</usage>
      </addressBlock>
      <description>RST</description>
      <groupName>RST</groupName>
      <registers>
        <register>
          <name>SR</name>
          <description>Reset status register</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>WWDGF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWDGF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ILLOPF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWIMF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EMCF</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI</name>
      <baseAddress>0x5200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0008</size>
        <usage>registers</usage>
      </addressBlock>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <registers>
        <register>
          <name>CR1</name>
          <description>SPI control register 1</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>CPHA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPOL</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSTR</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BR</name>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SPE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSBFIRST</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>SPI control register 2</description>
          <addressOffset>0x0001</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>SSI</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSM</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXONLY</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCNEXT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CECEN</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BDOE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BDM</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>SPI interrupt control register</description>
          <addressOffset>0x0002</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>WKIE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERRIE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXIE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXIE</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>SPI status register</description>
          <addressOffset>0x0003</addressOffset>
          <resetValue>0x02</resetValue>
          <fields>
            <field>
              <name>RXNE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUP</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCERR</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODF</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BSY</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>SPI data register</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCPR</name>
          <description>SPI CRC polynomial register</description>
          <addressOffset>0x0005</addressOffset>
          <resetValue>0x07</resetValue>
          <fields>
            <field>
              <name>CRCPOLY</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCRCR</name>
          <description>SPI Rx CRC register</description>
          <addressOffset>0x0006</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>RXCRC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCRCR</name>
          <description>SPI Tx CRC register</description>
          <addressOffset>0x0007</addressOffset>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
              <name>TXCRC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
