gicking/STM8_headers/SVD/STM8S208S6.svd
      </registers>
      <interrupt>
        <name>CAN_FMP</name>
        <description>CAN_FMP interrupt</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>CAN_FOVR</name>
        <description>CAN_FOVR interrupt</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>CAN_FULL</name>
        <description>CAN_FULL interrupt</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>CAN_BOFF</name>
        <description>CAN_BOFF interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>CAN_EPVF</name>
        <description>CAN_EPVF interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>CAN_EWGF</name>
        <description>CAN_EWGF interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>CAN_LEC0</name>
        <description>CAN_LEC0 interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>CAN_LEC1</name>
        <description>CAN_LEC1 interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>CAN_LEC2</name>
        <description>CAN_LEC2 interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>CAN_RQCP0</name>
        <description>CAN_RQCP0 interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>CAN_RQCP1</name>
        <description>CAN_RQCP1 interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>CAN_RQCP2</name>
        <description>CAN_RQCP2 interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>CAN_WKUI</name>
        <description>CAN_WKUI interrupt</description>
        <value>9</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>
